In [2]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [3]:
import random
random.seed(10)
print(random.random())

0.5714025946899135

In [4]:
for i in range(5):
    print(i)

0
1
2
3
4

In [5]:
for i in range(0,5):
    random.seed(0)
    print(random.randint(1, 1000))

865
865
865
865
865

In [6]:
random.seed(3)
print(random.randint(1, 1000))

random.seed(5)
print(random.randint(1, 1000))

244
638

In [7]:
txt = "hello, my name is Peter, I am 26 years old"

x = txt.split(", ")
print(x)

['hello', 'my name is Peter', 'I am 26 years old']

In [8]:
np.random.seed(5)
df = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns = "W X Y Z".split())
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [9]:
df["Z"]
# df['W']

A   -0.252092
B   -0.591637
C   -0.204877
D   -0.700179
E    0.644848
Name: Z, dtype: float64

In [10]:
df[["Z", "W"]]

          Z         W
A -0.252092  0.441227
B -0.591637  0.109610
C -0.204877  0.187603
D -0.700179 -0.358829
E  0.644848  1.151391

In [11]:
df.W

A    0.441227
B    0.109610
C    0.187603
D   -0.358829
E    1.151391
Name: W, dtype: float64

In [12]:
df.Y

A    2.430771
B   -0.909232
C   -1.192765
D   -1.664789
E   -1.511180
Name: Y, dtype: float64

In [13]:
type(df['W'])

pandas.core.series.Series

In [28]:
df['new'] = df['W']+df["X"]
df

          W         X         Y         Z       new
A  0.441227 -0.330870  2.430771 -0.252092  0.110357
B  0.109610  1.582481 -0.909232 -0.591637  1.692091
C  0.187603 -0.329870 -1.192765 -0.204877 -0.142267
D -0.358829  0.603472 -1.664789 -0.700179  0.244643
E  1.151391  1.857331 -1.511180  0.644848  3.008722

In [29]:
df.drop('new', axis = 1, inplace = True)
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [33]:
df.loc['A']
type(df.loc['A'])

pandas.core.series.Series

In [36]:
df.iloc[2]

W    0.187603
X   -0.329870
Y   -1.192765
Z   -0.204877
Name: C, dtype: float64

In [38]:
df.loc['A', 'W']

0.44122748688504143

In [40]:
df.loc[['A', 'B'],['W', 'Y']]

          W         Y
A  0.441227  2.430771
B  0.109610 -0.909232

In [43]:
df > 0

       W      X      Y      Z
A   True  False   True  False
B   True   True  False  False
C   True  False  False  False
D  False   True  False  False
E   True   True  False   True

In [45]:
df[df > 0]

          W         X         Y         Z
A  0.441227       NaN  2.430771       NaN
B  0.109610  1.582481       NaN       NaN
C  0.187603       NaN       NaN       NaN
D       NaN  0.603472       NaN       NaN
E  1.151391  1.857331       NaN  0.644848

In [54]:
import pandas as pd

record = {
    'Name' : ['Ankit', 'Amit', 'aishwariya', 'priya', 'ratik', 'ishu'],
    'Stream' : ['Math', 'Science', 'Commerce', 'Arts', 'BIO', 'BIO'],
    'Age' : [1, 2, 3, 4, 5, 6],
    'Percentage' : [88, 92, 95, 70, 65, 78]
}
dataframe = pd.DataFrame(data = record, columns = ['Name', 'Age', 'Stream', 'Percentage'])
print("Given DataFrame is : \n", dataframe)

# rslt_df = dataframe[dataframe['Percentage'] > 80]
rslt_df = dataframe[dataframe['Percentage'] != 95]
print("\nResult Data frame : \n", rslt_df)

Given DataFrame is :
          Name  Age    Stream  Percentage
0       Ankit    1      Math          88
1        Amit    2   Science          92
2  aishwariya    3  Commerce          95
3       priya    4      Arts          70
4       ratik    5       BIO          65
5        ishu    6       BIO          78

Result Data frame :
     Name  Age   Stream  Percentage
0  Ankit    1     Math          88
1   Amit    2  Science          92
3  priya    4     Arts          70
4  ratik    5      BIO          65
5   ishu    6      BIO          78

In [56]:
df['W']

A    0.441227
B    0.109610
C    0.187603
D   -0.358829
E    1.151391
Name: W, dtype: float64

In [57]:
df[df['W'] > 0]

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
E  1.151391  1.857331 -1.511180  0.644848

In [59]:
df[df['W'] > 0]['Y']

A    2.430771
B   -0.909232
C   -1.192765
E   -1.511180
Name: Y, dtype: float64

In [62]:
df[df['W'] < 0][['X', 'Y']]

          X         Y
D  0.603472 -1.664789

In [67]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W        X         Y         Z
A  0.441227 -0.33087  2.430771 -0.252092

In [69]:
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [74]:
df.reset_index()

  index         W         X         Y         Z States
0     A  0.441227 -0.330870  2.430771 -0.252092     CA
1     B  0.109610  1.582481 -0.909232 -0.591637     NY
2     C  0.187603 -0.329870 -1.192765 -0.204877     WY
3     D -0.358829  0.603472 -1.664789 -0.700179     OR
4     E  1.151391  1.857331 -1.511180  0.644848     CO

In [75]:
newind = "CA NY WY OR CO".split()
df['States'] = newind
df

          W         X         Y         Z States
A  0.441227 -0.330870  2.430771 -0.252092     CA
B  0.109610  1.582481 -0.909232 -0.591637     NY
C  0.187603 -0.329870 -1.192765 -0.204877     WY
D -0.358829  0.603472 -1.664789 -0.700179     OR
E  1.151391  1.857331 -1.511180  0.644848     CO

In [77]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.441227 -0.330870  2.430771 -0.252092
NY      0.109610  1.582481 -0.909232 -0.591637
WY      0.187603 -0.329870 -1.192765 -0.204877
OR     -0.358829  0.603472 -1.664789 -0.700179
CO      1.151391  1.857331 -1.511180  0.644848

In [83]:
df

               W         X         Y         Z
States
CA      0.441227 -0.330870  2.430771 -0.252092
NY      0.109610  1.582481 -0.909232 -0.591637
WY      0.187603 -0.329870 -1.192765 -0.204877
OR     -0.358829  0.603472 -1.664789 -0.700179
CO      1.151391  1.857331 -1.511180  0.644848

In [85]:
# df.set_index('States', inplace = True)
df

               W         X         Y         Z
States
CA      0.441227 -0.330870  2.430771 -0.252092
NY      0.109610  1.582481 -0.909232 -0.591637
WY      0.187603 -0.329870 -1.192765 -0.204877
OR     -0.358829  0.603472 -1.664789 -0.700179
CO      1.151391  1.857331 -1.511180  0.644848

In [91]:
name = ['a', 'b', 'c', 'd']
roll_no = [1, 2, 3, 4]

mapped = zip(name, roll_no)
print(set(mapped))

{('c', 3), ('b', 2), ('a', 1), ('d', 4)}

In [93]:
name = ['a', 'b', 'c']
age = [20, 24, 27]

for i, (name, age) in enumerate(zip(name, age)):
    print(i, name, age)

0 a 20
1 b 24
2 c 27

In [97]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]

hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [99]:
df = pd.DataFrame(np.random.randn(6, 2), index = hier_index, columns = "A B".split())
df

             A         B
G1 1 -0.006195 -0.101068
   2 -0.052308  0.249218
   3  0.197660  1.334849
G2 1 -0.086876  1.561532
   2 -0.305853 -0.477731
   3  0.100738  0.355438

In [112]:
df.loc['G1']

            A         B
Num
1   -0.006195 -0.101068
2   -0.052308  0.249218
3    0.197660  1.334849

In [105]:
df.index.names

FrozenList([None, None])

In [110]:
df.index.names = ["Group", 'Num']
df

                  A         B
Group Num
G1    1   -0.006195 -0.101068
      2   -0.052308  0.249218
      3    0.197660  1.334849
G2    1   -0.086876  1.561532
      2   -0.305853 -0.477731
      3    0.100738  0.355438

In [113]:
df.xs('G1')

            A         B
Num
1   -0.006195 -0.101068
2   -0.052308  0.249218
3    0.197660  1.334849

In [116]:
df.xs(['G1', 1])

/var/folders/nk/gxdrmky141939n91br_2qdlh0000gn/T/ipykernel_3812/2011919136.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1', 1])

A   -0.006195
B   -0.101068
Name: (G1, 1), dtype: float64

In [119]:
df.xs('G1', level = 'Group')

            A         B
Num
1   -0.006195 -0.101068
2   -0.052308  0.249218
3    0.197660  1.334849